In [2]:
import pandas as pd

In [5]:
idades = pd.Series([25,30,46,25,58])

In [6]:
idades

0    25
1    30
2    46
3    25
4    58
dtype: int64

In [7]:
idades.index

RangeIndex(start=0, stop=5, step=1)

In [9]:
idades.values

array([25, 30, 46, 25, 58])

In [10]:
idades = pd.Series([25,30,46,25,58], index=['ana','jose','maria','pedro','carla'])

In [11]:
idades

ana      25
jose     30
maria    46
pedro    25
carla    58
dtype: int64

In [12]:
idades.index

Index(['ana', 'jose', 'maria', 'pedro', 'carla'], dtype='object')

In [13]:
idades['ana']

np.int64(25)

In [18]:
dados = {
    'nome':['alice','bob','charlie','davif'],
    'idade':[25,30,22,28]
}

In [19]:
df = pd.DataFrame(dados)

In [20]:
df

      nome  idade
0    alice     25
1      bob     30
2  charlie     22
3    davif     28

In [21]:
df['nome']

0      alice
1        bob
2    charlie
3      davif
Name: nome, dtype: object

In [22]:
df['idade']

0    25
1    30
2    22
3    28
Name: idade, dtype: int64

In [29]:
df.iloc[0,0]

'alice'

In [31]:
df.loc[0,'nome']

'alice'

In [32]:
funcionarios = pd.read_csv('/home/laza/estatistica-treina/aula_01/funcionario.csv')

In [33]:
funcionarios

,_id,matricula,nome,cargo_emprego,jornada_trabalho
0,1,39810,Hercilio Matias de Oliveira,TECNICO EM CONTABILIDADE,40 HORAS SEMANAIS
1,2,41894,Jose Dutra Amorim,CONTADOR,40 HORAS SEMANAIS
2,3,41933,Marcos Antonio Petrucci de Assis,ASSISTENTE EM ADMINISTRACAO,40 HORAS SEMANAIS
3,4,41938,Jansen Tinoco de Medeiros,VIGILANTE,40 HORAS SEMANAIS
4,5,47258,Eugenio Pacelli Fernandes Leite,PROFESSOR ENS BASICO TECN TECNOLOGICO,DEDICACAO EXCLUSIVA
...,...,...,...,...,...
2962,2963,3143253,Gustavo Dias da Silva,PROF ENS BAS TEC TECNOLOGICO-SUBSTITUTO,40 HORAS SEMANAIS
2963,2964,3143745,Jose Paulo de Oliveira Neto,NaN,20 HORAS SEMANAIS
2964,2965,3143816,Cristiane Leal Rodrigues Soares,PROF ENS BAS TEC TECNOLOGICO-SUBSTITUTO,40 HORAS SEMANAIS
2965,2966,3143859,Jandui Evangelista de Oliveira,PROF ENS BAS TEC TECNOLOGICO-SUBSTITUTO,40 HORAS SEMANAIS
2966,2967,3143860,Elisenaide Bezerra Santos,PROF ENS BAS TEC TECNOLOGICO-SUBSTITUTO,40 HORAS SEMANAIS

In [34]:
funcionarios.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2967 entries, 0 to 2966
Data columns (total 5 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   _id               2967 non-null   int64
 1   matricula         2967 non-null   int64
 2   nome              2967 non-null   object
 3   cargo_emprego     2860 non-null   object
 4   jornada_trabalho  2964 non-null   object
dtypes: int64(2), object(3)
memory usage: 116.0+ KB

In [35]:
funcionarios['matricula']

0         39810
1         41894
2         41933
3         41938
4         47258
         ...
2962    3143253
2963    3143745
2964    3143816
2965    3143859
2966    3143860
Name: matricula, Length: 2967, dtype: int64

In [38]:
funcionarios2 = pd.read_excel('/home/laza/estatistica-treina/aula_01/funcionario.xlsx',sheet_name='nome')

In [39]:
funcionarios2

,_id,matricula,nome,cargo_emprego,jornada_trabalho
0,1,39810,Hercilio Matias de Oliveira,TECNICO EM CONTABILIDADE,40 HORAS SEMANAIS
1,2,41894,Jose Dutra Amorim,CONTADOR,40 HORAS SEMANAIS
2,3,41933,Marcos Antonio Petrucci de Assis,ASSISTENTE EM ADMINISTRACAO,40 HORAS SEMANAIS
3,4,41938,Jansen Tinoco de Medeiros,VIGILANTE,40 HORAS SEMANAIS
4,5,47258,Eugenio Pacelli Fernandes Leite,PROFESSOR ENS BASICO TECN TECNOLOGICO,DEDICACAO EXCLUSIVA
...,...,...,...,...,...
2962,2963,3143253,Gustavo Dias da Silva,PROF ENS BAS TEC TECNOLOGICO-SUBSTITUTO,40 HORAS SEMANAIS
2963,2964,3143745,Jose Paulo de Oliveira Neto,NaN,20 HORAS SEMANAIS
2964,2965,3143816,Cristiane Leal Rodrigues Soares,PROF ENS BAS TEC TECNOLOGICO-SUBSTITUTO,40 HORAS SEMANAIS
2965,2966,3143859,Jandui Evangelista de Oliveira,PROF ENS BAS TEC TECNOLOGICO-SUBSTITUTO,40 HORAS SEMANAIS
2966,2967,3143860,Elisenaide Bezerra Santos,PROF ENS BAS TEC TECNOLOGICO-SUBSTITUTO,40 HORAS SEMANAIS

In [40]:
funcionarios2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2967 entries, 0 to 2966
Data columns (total 5 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   _id               2967 non-null   int64
 1   matricula         2967 non-null   int64
 2   nome              2967 non-null   object
 3   cargo_emprego     2860 non-null   object
 4   jornada_trabalho  2964 non-null   object
dtypes: int64(2), object(3)
memory usage: 116.0+ KB

In [42]:
funcionarios2['nome']

0            Hercilio Matias de Oliveira
1                      Jose Dutra Amorim
2       Marcos Antonio Petrucci de Assis
3              Jansen Tinoco de Medeiros
4        Eugenio Pacelli Fernandes Leite
                      ...
2962               Gustavo Dias da Silva
2963         Jose Paulo de Oliveira Neto
2964     Cristiane Leal Rodrigues Soares
2965      Jandui Evangelista de Oliveira
2966           Elisenaide Bezerra Santos
Name: nome, Length: 2967, dtype: object

In [43]:
funcionarios2.index

RangeIndex(start=0, stop=2967, step=1)

In [44]:
funcionarios2.values

array([[1, 39810, 'Hercilio Matias de Oliveira',
        'TECNICO EM CONTABILIDADE', '40 HORAS SEMANAIS'],
       [2, 41894, 'Jose Dutra Amorim', 'CONTADOR', '40 HORAS SEMANAIS'],
       [3, 41933, 'Marcos Antonio Petrucci de Assis',
        'ASSISTENTE EM ADMINISTRACAO', '40 HORAS SEMANAIS'],
       ...,
       [2965, 3143816, 'Cristiane Leal Rodrigues Soares',
        'PROF ENS BAS TEC TECNOLOGICO-SUBSTITUTO', '40 HORAS SEMANAIS'],
       [2966, 3143859, 'Jandui Evangelista de Oliveira',
        'PROF ENS BAS TEC TECNOLOGICO-SUBSTITUTO', '40 HORAS SEMANAIS'],
       [2967, 3143860, 'Elisenaide Bezerra Santos',
        'PROF ENS BAS TEC TECNOLOGICO-SUBSTITUTO', '40 HORAS SEMANAIS']],
      shape=(2967, 5), dtype=object)

In [45]:
funcionarios2.columns

Index(['_id', 'matricula', 'nome', 'cargo_emprego', 'jornada_trabalho'], dtype='object')

In [46]:
df

      nome  idade
0    alice     25
1      bob     30
2  charlie     22
3    davif     28

In [47]:
df_maior26 = df['idade'] > 26

In [48]:
df_maior26

0    False
1     True
2    False
3     True
Name: idade, dtype: bool

In [49]:
print(df_maior26)

0    False
1     True
2    False
3     True
Name: idade, dtype: bool

In [53]:
idades

ana      25
jose     30
maria    46
pedro    25
carla    58
dtype: int64

In [55]:
df.columns

Index(['nome', 'idade'], dtype='object')

In [56]:
df[df['idade'] > 26]

    nome  idade
1    bob     30
3  davif     28

In [58]:
df['cidade'] = ['Recife','olinda','jaboatao','camaragibe']

In [59]:
df

      nome  idade      cidade
0    alice     25      Recife
1      bob     30      olinda
2  charlie     22    jaboatao
3    davif     28  camaragibe

In [62]:
df = df.drop(['cidade'],axis=1)

In [63]:
df

      nome  idade
0    alice     25
1      bob     30
2  charlie     22
3    davif     28

In [64]:
df = df.drop(['idade'],axis=1)

In [65]:
df

      nome
0    alice
1      bob
2  charlie
3    davif